Autodesk.Revit.DB.Analysis.BuildingOperatingDaySchedule.IsDeletable
Can the schedule safely be deleted?
Returns:
true if this can currently be deleted, false if it should not be.
Since:
2025

Autodesk.Revit.DB.Analysis.BuildingOperatingDaySchedule.SetValueForHour(System.Int32,System.Double)
Sets the usage value for an hour.
hour:
The hour in the day, as an integer. For example: 0 is 12:00 midnight to 1:00 am, 6 is 6:00 am to 7:00 am, 12 is 12:00 noon to 1:00 pm, and 23 is 11:00 pm to midnight.
To avoid issues around daylight savings times, these hours represent 1/24 of an earth rotation, and will not be exactly 60 minutes.
usage:
The usage as a fraction between 0 and 1 inclusive. For example: 0 in a lighting schedule means all lights are off, .5 means half of lights are on, 1 means all lights are on.
Throws Autodesk.Revit.Exceptions.ArgumentException:
hour must be from 0 to 23 inclusive.
-or-
usage should be less than or equal to 1.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for usage must be non-negative.
Since:
2025

Autodesk.Revit.DB.Analysis.BuildingOperatingDaySchedule.GetValueForHour(System.Int32)
Gets the usage value for an hour.
hour:
The hour in the day, as an integer. For example: 0 is 12:00 midnight to 1:00 am, 6 is 6:00 am to 7:00 am, 12 is 12:00 noon to 1:00 pm, and 23 is 11:00 pm to midnight.
To avoid issues around daylight savings times, these hours represent 1/24 of an earth rotation, and will not be exactly 60 minutes.
Returns:
The usage as a fraction between 0 and 1 inclusive. For example: 0 in a lighting schedule means all lights are off, .5 means half of lights are on, 1 means all lights are on.
Throws Autodesk.Revit.Exceptions.ArgumentException:
hour must be from 0 to 23 inclusive.
Since:
2025

Autodesk.Revit.DB.Analysis.BuildingOperatingDaySchedule.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new instance of a BuildingOperatingDaySchedule.
Remarks:
The new BuildingOperatingDaySchedule will have all values set to off.
document:
The document to create the new BuildingOperatingDaySchedule element.
name:
The intended name of the newly created BuildingOperatingDaySchedule, may be modified to disambiguate with existing element.
Returns:
The newly created BuildingOperatingDaySchedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
name must be trimmed.
-or-
name is an empty string or contains only whitespace.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Analysis.BuildingOperatingDaySchedule.ScheduleName
The name of the schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name must not match an existing name, even with different case.
-or-
When setting this property: name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
When setting this property: name must be trimmed.
-or-
When setting this property: name is an empty string or contains only whitespace.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Analysis.BuildingOperatingDaySchedule
Represents the operating schedule of a 24 hour day.
Since:
2025